doc/src/config_reference.org
#+TITLE:     ClojureGP: Experiment configuration key reference
#+AUTHOR:    Stefan van der Meer
#+EMAIL:     stefanvandermeerREMOVE@THISgmail.com
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:nil toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+STYLE: <link rel="stylesheet" type="text/css" href="docstyle.css" />
#+STYLE: <style type="text/css">
#+STYLE: .outline-2 { border: 1px solid #EEE; margin-bottom: 0.2em; }
#+STYLE: .outline-3 { padding-left: 1em; }
#+STYLE: .outline-3 p { margin-top: 0.5em; padding-left: 0.25em; }
#+STYLE: h2 { margin-top: 0; padding: 0.1em; background: #CEF;
#+STYLE:    }
#+STYLE: h3 { font-size: 10pt; margin-bottom: 1pt; }
#+STYLE: </style>

This document is intended as a reference of every key in an experiment
configuration that is used by the ClojureGP functions during a GP run. Examples,
default values, background information and customisation advice is included.

It is not the best place to start learning about the basics of experiment
configurations, being intended as a reference. Looking at the included examples
first is recommended.

* :arg-list
# <<:arg-list>>
** Purpose
Defines the argument list of evolved functions. Config preprocessing uses
=make-func-template= internally to turn the value of this key into an
appropriate [[:func-template-fn]] function.
** Requirements
Must be a vector of zero or more symbols.
** Default value
None, as there is a default for [[:func-template-fn]].
** Details
This is a simple shortcut for when [[:func-template-fn]] looks scary. Setting
={:arg-list '[x y z]}= is essentially equivalent to setting ={:func-template-fn
(make-func-template '[x y z])}=. If a value for [[:func-template-fn]] is set, this
key will be ignored.

* :breeders
# <<:breeders>>
** Purpose
Defines the breeding functions that will be used, and the likelihood of their
being used when breeding a new individual.
** Requirements
Must be a collection (vector recommended) of maps with two keys:
- =:breeder-fn=, specifying a breeding function
- =:prob=, specifying the probability of that breeding function being used

Probabilities for all breeders must add up to 1.
** Default value
#+BEGIN_SRC clojure
[{:prob 0.8  :breeder-fn crossover-breeder}
 {:prob 0.1  :breeder-fn mutation-breeder}
 {:prob 0.1  :breeder-fn reproduction-breeder}]
#+END_SRC
** Details
The default value illustrates the form this value should take, and shows a
configuration with three included breeder functions.

Of more interest is the form a custom breeder function should take. Such a
function should take two arguments: a population, and the experiment
configuration map. It should return a seq of (newly bred) individuals. This seq
can contain any number of individuals (not all of them are guaranteed to be
used, especially if it is very long), and may also be =nil=.

The breeders that are provided are (at the time of writing):
  - =crossover-breeder=
  - =mutation-breeder=
  - =reproduction-breeder=

Take a look at their docstring (or GP literature[fn:gpfg]) for details of their
operation, and their source for examples of how to write your own breeders.

* :breeding-retries
# <<:breeding-retries>>
** Purpose
Defines the number of retries a breeder should attempt in generating a valid
tree.
** Requirements
Must be a non-decimal number.
** Default value
1
** Details
The breeders included with cljgp will use this setting to determine how many
times to attempt generating a valid tree if the first one fails.

This can be useful when dealing with strict type structures, or breeders that
fail often.


* :end-condition-fn
# <<:end-condition-fn>>
** Purpose
Defines the function (predicate) that will be used to determine when the
evolution process is complete.
** Requirements
Must be a function that takes a population (= a generation) as its only
argument, and returns a true or false value. True means the evolution process
should stop.
** Default value
=(cljgp.config/make-end 100)=
** Details
This function will be called after each generation has been evaluated, in order
to test if the evolution process is complete. The default end condition function
tests if either the maximum number of generations has been reached, or there
exists an individual with perfect fitness.

The provided =cljgp.config/make-end= function can be used to easily generate a
predicate that performs those tests, for example:
#+BEGIN_SRC clojure
(def my-config
     {...
      :end-condition-fn (make-end 50)
      ...})
#+END_SRC

In this example the experiment will run until a perfect individual is found, or
the limit of 50 generations is reached. Check the source of =make-end= if you
wish to implement a different kind of test.


* :evaluation-fn
# <<:evaluation-fn>>
** Purpose
Defines the function that will be used to evaluate evolved functions.
** Requirements
Must be a function that takes a single argument, namely a function.
Must return either a fitness value in the form of a number, or a map that
includes a :fitness key and any additional information you may want to include.
** Default value
*Required key*, no default available.
