doc/config_reference.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>ClojureGP: Experiment configuration key reference</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009"/>
<meta name="author" content="Stefan van der Meer"/>

<link rel="stylesheet" type="text/css" href="docstyle.css" />


</head><body>
<h1 class="title">ClojureGP: Experiment configuration key reference</h1>

<p>This document is intended as a reference of every key in an experiment
configuration that is used by the ClojureGP functions during a GP run. Examples,
default values, background information and customisation advice is included.
</p>
<p>
It is not the best place to start learning about the basics of experiment
configurations, being intended as a reference. Looking at the included examples
first is recommended.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">:arg-list </a></li>
<li><a href="#sec-2">:breeders </a></li>
<li><a href="#sec-3">:breeding-retries </a></li>
<li><a href="#sec-4">:end-condition-fn </a></li>
<li><a href="#sec-5">:evaluation-fn </a></li>
<li><a href="#sec-6">:func-template-fn </a></li>
<li><a href="#sec-7">:function-set </a></li>
<li><a href="#sec-8">:pop-generation-fn </a></li>
<li><a href="#sec-9">:population-size </a></li>
<li><a href="#sec-10">:rand-seeds </a></li>
<li><a href="#sec-11">:rand-fn-maker </a></li>
<li><a href="#sec-12">:root-type </a></li>
<li><a href="#sec-13">:selection-fn </a></li>
<li><a href="#sec-14">:terminal-set </a></li>
<li><a href="#sec-15">:threads </a></li>
<li><a href="#sec-16">:validate-tree-fn </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">:arg-list </h2>
<div id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">Purpose </h3>
<div id="text-1.1">

<p>Defines the argument list of evolved functions. Config preprocessing uses
<code>make-func-template</code> internally to use the value of this key into an
appropriate <a href="#sec-6">:func-template-fn</a>.
</p></div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">Requirements </h3>
<div id="text-1.2">

<p>Must be a vector of zero or more symbols.
</p></div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3">Default value </h3>
<div id="text-1.3">

<p>None, as there is a default for <a href="#sec-6">:func-template-fn</a>.
</p></div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4">Details </h3>
<div id="text-1.4">

<p>This is a simple shortcut for when <a href="#sec-6">:func-template-fn</a> looks scary. Setting
<code>{:arg-list my-vec}</code> is essentially equivalent to setting <code>{:func-template-fn (make-func-template my-vec)}</code>. If a value for <a href="#sec-6">:func-template-fn</a> is set, this
key will be ignored.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">:breeders </h2>
<div id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1">Purpose </h3>
<div id="text-2.1">

<p>Defines the breeding functions that will be used, and the probability of their
usage.
</p></div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2">Requirements </h3>
<div id="text-2.2">

<p>Must be a collection (vector recommended) of maps with two keys:
</p><ul>
<li>
<code>:breeder-fn</code>, specifying a breeding function
</li>
<li>
<code>:prob</code>, specifying the probability of that breeding function being used

</li>
</ul>

<p>Probabilities for all breeders must add up to 1.
</p></div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3">Default value </h3>
<div id="text-2.3">




<pre class="src src-clojure">
[{<span style="color: #AABBFF;">:prob</span> 0.8  <span style="color: #AABBFF;">:breeder-fn</span> crossover-breeder}
 {<span style="color: #AABBFF;">:prob</span> 0.1  <span style="color: #AABBFF;">:breeder-fn</span> mutation-breeder}
 {<span style="color: #AABBFF;">:prob</span> 0.1  <span style="color: #AABBFF;">:breeder-fn</span> reproduction-breeder}]
</pre>



</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4">Details </h3>
<div id="text-2.4">

<p>The default value illustrates the form this value should take, and shows a
configuration with three included breeder functions.
</p>
<p>
Of more interest is the form a custom breeder function should take. Such a
function should take two arguments: a population, and the experiment
configuration map. It should return a seq of (newly bred) individuals. This seq
can contain any number of individuals (not all of them are guaranteed to be
used, especially if it is very long), and may also be <code>nil</code>.
</p>
<p>
The breeders that are provided are (at the time of writing):
</p><ul>
<li>
<code>crossover-breeder</code>
</li>
<li>
<code>mutation-breeder</code>
</li>
<li>
<code>reproduction-breeder</code>

</li>
</ul>

<p>Take a look at their docstring (or GP literature<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>) for details of their
operation, and their source for examples of how to write your own breeders.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">:breeding-retries </h2>
<div id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">Purpose </h3>
<div id="text-3.1">

<p>Defines the number of retries a breeder should attempt in generating a valid
tree.
</p></div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2">Requirements </h3>
<div id="text-3.2">

<p>Must be a non-decimal number.
</p></div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3">Default value </h3>
<div id="text-3.3">

<p>1
</p></div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4">Details </h3>
<div id="text-3.4">

<p>The breeders included with cljgp will use this setting to determine how many
times to attempt generating a valid tree if the first one fails.
</p>
<p>
This can be useful when dealing with strict type structures, or breeders that
fail often.
</p>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">:end-condition-fn </h2>
<div id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1">Purpose </h3>
<div id="text-4.1">

<p>Defines the function (predicate) that will be used to determine when the
evolution process is complete.
</p></div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2">Requirements </h3>
<div id="text-4.2">

<p>Must be a function that takes a population (= a generation) as its only
argument, and returns a true or false value. True means the evolution process
should stop.
</p></div>

</div>

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3">Default value </h3>
<div id="text-4.3">

<p><code>(cljgp.config/make-end 100)</code>
</p></div>

</div>

<div id="outline-container-4.4" class="outline-3">
<h3 id="sec-4.4">Details </h3>
<div id="text-4.4">

<p>This function will be called after each generation has been evaluated, in order
to test if the evolution process is complete. The default end condition function
tests if either the maximum number of generations has been reached, or there
exists an individual with perfect fitness.
</p>
<p>
The provided <code>cljgp.config/make-end</code> function can be used to easily generate a
predicate that performs those tests, for example:
</p>


<pre class="src src-clojure">
(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">my-config</span>
     {...
      <span style="color: #AABBFF;">:end-condition-fn</span> (make-end 50)
      ...})
</pre>




<p>
In this example the experiment will run until a perfect individual is found, or
the limit of 50 generations is reached. Check the source of <code>make-end</code> if you
wish to implement a different kind of test.
</p>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><a name=":evaluation-fn" id=":evaluation-fn"></a>:evaluation-fn </h2>
<div id="text-5">


</div>

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1">Purpose </h3>
<div id="text-5.1">

<p>Defines the function that will be used to evaluate evolved functions.
</p></div>

</div>

<div id="outline-container-5.2" class="outline-3">
<h3 id="sec-5.2">Requirements </h3>
<div id="text-5.2">

<p>Must be a function that takes a single argument, namely a function.
Must return either a fitness value in the form of a number, or a map that
includes a :fitness key and any additional information you may want to include.
</p></div>

</div>
