doc/src/config_reference.org
** Details
The function configured as value of this key will be called on every evolved
function in order to generate a fitness value for it.

Fitness values should follow the "lower is better" rule. The default end
condition predicate considers a fitness of 0 to mean that the individual is
perfect.

If the evaluation function returns a number, it will be used as the individual's
=:fitness= value (as individuals are represented as maps). If a map is returned,
it will be merged into the individual. This allows you to store additional
values you may be interested in, such as "hits" or raw fitness.

For examples of fitness functions, see the included example experiments, as they
are of course very domain specific.

* :func-template-fn
# <<:func-template-fn>>
** Purpose
Defines the function that will be used to wrap the S-expression trees (trees
represented as quoted nested lists) generated by the GP process in =fn= forms,
so that they will evaluate to functions.
** Requirements
Must be a function that takes a tree as argument and returns a =(fn ...)=
expression (i.e., a list).
** Default value
=(cljgp.config/make-func-template)=
** Details
This is a complex configuration option, but for most uses the provided
=cljgp.config/make-func-template= function can be used to easily generate a
function that can be used as the value for it.

The background of this option is the following: all individuals consist of a
function expression (and some other values), which is compiled to a function
using =eval= during the evaluation phase of the GP process. This function is
passed to the user-defined evaluation function, which can then apply it to test
its fitness. It can be useful to customise the function expression, for example
to define an argument list, or to name the function.

By defining an argument list, it becomes very easy to pass in values to the
evolved function, and basically treat it as a "real" Clojure function. Naming
the function could be useful for evolving recursive functions. These two
possibilities are easy to access by using the previously mentioned
=make-func-template= function. It is used as follows:
#+BEGIN_SRC clojure
(def my-config
     {...
      :func-template-fn (make-func-template foo '[x y])
      ...})
#+END_SRC

When using the function-templating function (what a name...) generated there,
all individuals will compile to a function called =foo=, with =x= and =y= as
arguments. Their function expression will look something like =(fn foo [x y]
...)=.

In your evaluation function, you could then call them
as follows:
#+BEGIN_SRC clojure
(defn my-evaluation
  [evolved-func]
  (let [result (evolved-func 100 3.14)]
    ...))
#+END_SRC

This is much more convenient than using =binding= to pass in values.

An advanced usage could be to wrap each individual's expression tree in a macro
that performs some sort of preprocessing, for example. See the source of
=make-func-template= for details of what a custom template-fn should return.

* :function-set
# <<:function-set>>
** Purpose
Defines the set of functions available to the GP process, and their relevant
properties.
** Requirements
Must be a sequence of symbols. The symbols must have metadata that defines the
=:gp-type= and =:gp-arg-types= keys. The value for =:gp-type= must be a valid
type (keyword, Java class, or nil), and the value for =:gp-arg-types= must be a
sequence of valid types.
** Default value
*Required key*, no default available.
