doc/config_reference.html

<div id="outline-container-5.3" class="outline-3">
<h3 id="sec-5.3">Default value </h3>
<div id="text-5.3">

<p><b>Required key</b>, no default available.
</p></div>

</div>

<div id="outline-container-5.4" class="outline-3">
<h3 id="sec-5.4">Details </h3>
<div id="text-5.4">

<p>The function configured as value of this key will be called on every evolved
function in order to generate a fitness value for it.
</p>
<p>
Fitness values should follow the "lower is better" rule. The default end
condition predicate considers a fitness of 0 to mean that the individual is
perfect.
</p>
<p>
If the evaluation function returns a number, it will be used as the individual's
<code>:fitness</code> value (as individuals are represented as maps). If a map is returned,
it will be merged into the individual. This allows you to store additional
values you may be interested in, such as "hits" or raw fitness.
</p>
<p>
For examples of fitness functions, see the included example experiments, as they
are of course very domain specific.
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><a name=":func-template-fn" id=":func-template-fn"></a>:func-template-fn </h2>
<div id="text-6">


</div>

<div id="outline-container-6.1" class="outline-3">
<h3 id="sec-6.1">Purpose </h3>
<div id="text-6.1">

<p>Defines the function that will be used to wrap the S-expression trees (trees
represented as quoted nested lists) generated by the GP process in <code>fn</code> forms,
so that they will evaluate to functions.
</p></div>

</div>

<div id="outline-container-6.2" class="outline-3">
<h3 id="sec-6.2">Requirements </h3>
<div id="text-6.2">

<p>Must be a function that takes a tree as argument and returns a <code>(fn ...)</code>
expression (i.e., a list).
</p></div>

</div>

<div id="outline-container-6.3" class="outline-3">
<h3 id="sec-6.3">Default value </h3>
<div id="text-6.3">

<p><code>(cljgp.config/make-func-template)</code>
</p></div>

</div>

<div id="outline-container-6.4" class="outline-3">
<h3 id="sec-6.4">Details </h3>
<div id="text-6.4">

<p>This is a complex configuration option, but for most uses the provided
<code>cljgp.config/make-func-template</code> function can be used to easily generate a
function that can be used as the value for it.
</p>
<p>
The background of this option is the following: all individuals consist of a
function expression (and some other values), which is compiled to a function
using <code>eval</code> during the evaluation phase of the GP process. This function is
passed to the user-defined evaluation function, which can then apply it to test
its fitness. It can be useful to customise the function expression, for example
to define an argument list, or to name the function.
</p>
<p>
By defining an argument list, it becomes very easy to pass in values to the
evolved function, and basically treat it as a "real" Clojure function. Naming
the function could be useful for evolving recursive functions. These two
possibilities are easy to access by using the previously mentioned
<code>make-func-template</code> function. It is used as follows:
</p>


<pre class="src src-clojure">
(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">my-config</span>
     {...
      <span style="color: #AABBFF;">:func-template-fn</span> (make-func-template foo '[x y])
      ...})
</pre>




<p>
When using the function-templating function (what a name&hellip;) generated there,
all individuals will compile to a function called <code>foo</code>, with <code>x</code> and <code>y</code> as
arguments. Their function expression will look something like <code>(fn foo [x y] ...)</code>.
</p>
<p>
In your evaluation function, you could then call them
as follows:
</p>


<pre class="src src-clojure">
(<span style="color: #4477FF; font-weight: bold;">defn</span> <span style="color: #BB3344;">my-evaluation</span>
  [evolved-func]
  (<span style="color: #4477FF; font-weight: bold;">let</span> [result (evolved-func 100 3.14)]
    ...))
</pre>




<p>
This is much more convenient than using <code>binding</code> to pass in values.
</p>
<p>
An advanced usage could be to wrap each individual's expression tree in a macro
that performs some sort of preprocessing, for example. See the source of
<code>make-func-template</code> for details of what a custom template-fn should return.
</p>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><a name=":function-set" id=":function-set"></a>:function-set </h2>
<div id="text-7">


</div>

<div id="outline-container-7.1" class="outline-3">
<h3 id="sec-7.1">Purpose </h3>
<div id="text-7.1">

<p>Defines the set of functions available to the GP process, and their relevant
properties.
</p></div>

</div>

<div id="outline-container-7.2" class="outline-3">
<h3 id="sec-7.2">Requirements </h3>
<div id="text-7.2">

<p>Must be a sequence of symbols. The symbols must have metadata that defines the
<code>:gp-type</code> and <code>:gp-arg-types</code> keys. The value for <code>:gp-type</code> must be a valid
type (keyword, Java class, or nil), and the value for <code>:gp-arg-types</code> must be a
sequence of valid types.
</p></div>

</div>
