doc/src/config_reference.org
** Details
The =:function-set= key defines a collection of symbols. These symbols will be
used by the GP process at function positions in the generated trees (in tree
terms: non-terminal or non-leaf nodes). To do this, the type of the function
symbol, the number of arguments, and the required type of the arguments has to
be defined. This is achieved through the =:gp-type= metadata key, which defines
the type of the function, and the =:gp-arg-types= metadata key, which must
define a positional sequence of argument types. This is best illustrated with an
example.

Let's say we want to use Clojure's standard =nth= function in an experiment. We
could define it as follows in the experiment configuration:
#+BEGIN_SRC clojure
(def my-config
     {:function-set [(primitive `nth {:gp-type ::element
				      :gp-arg-types [::index ::seq]})
		     ...]})
#+END_SRC

The =primitive= function simply takes a symbol and map as argument, and returns
the symbol with the map as metadata (think =with-meta= with a more fitting name
for this purpose).

Note the backquoting of the symbol: using just =nth= will not work, as that
would be the /value/ of =nth=, i.e., the function itself. Using a normal quote,
@<code>'nth@</code>, would work in this case, but keep in mind that the symbol
is resolved to its namespace in an =eval= call in the =cljgp.evaluation=
namespace. This will not cause problems for Clojure functions, but any functions
you define will not be available, causing errors. For that reason it is a good
habit to always backtick symbols so that they are namespaced correctly, unless
they will be locals (i.e., they will be passed in as argument).

Back to the function arguments. Clojure's =nth= function takes an index as first
argument, and a sequence as second, and returns the element in the sequence at
the index. Using the given definition, the GP process will only use =nth= in a
tree at a position where a node of type =::element= is allowed. Then, as its
first argument only nodes of type =::index= will be used, and any node that may
be considered as its second argument must be of type =::seq=.

These type relations are tested using =isa?=, which means you can use Clojure's
powerful ad hoc hierarchy functionality to define your own type hierarchy. Java
class identifiers can also be used.

The value of =nil= can also be used as type, though it is only useful for
performing a GP run without any type restrictions, by using =nil= for all
types. Because =isa?= is used for type checking, and the only combination with
=nil= for which it returns true is =(isa? nil nil)=, its use is identical to
using a keyword that is not part of a hierarchy. Hence, it is almost always a
better idea to use a keyword (for example, =::any=) so that it is easier to
define a type hierarchy later on. For an untyped GP experiment, the above
definition could look like this:
#+BEGIN_SRC clojure
(def my-untyped-config
     {:function-set [(primitive `nth {:gp-type ::any
				      :gp-arg-types [::any ::any]})
		     ...]})
#+END_SRC

If you have a function that does not take arguments, but does need to be
applied, use an empty vector for =:gp-arg-types=.

Note that although the key is called a /set/, it is not recommended that you use
a Clojure set to define it. Due to implementation details (involving the use of
=nth=) these will be relatively slow. Vectors are a much faster choice.

* :pop-generation-fn
# <<:pop-generation-fn>>
** Purpose
Defines the function used to generate the initial population of individuals (the
size of which is defined in [[:population-size]].
** Requirements
Must be a function that takes an experiment configuration as its argument (from
which values such as the function and terminal sets can be retrieved), and
returns a tree or =nil=.
** Default value
=#(cljgp.breeding/generate-ramped {:max-depth 7, :grow-chance 0.5} %1)=

/(Equivalent to/ =(partial generate-ramped {:max-depth 7, :grow-chance 0.5})= /)./
** Details
In order to perform a GP run, an initial population is required. The function
defined as value of this key is used to generate the expression trees in the
population. Note the important difference between the breeding functions (which
return full individuals) and this function (which return just trees).

When a valid tree has been generated by this function, cljgp will insert the
tree into the appropriate =fn= form (using [[:func-template-fn]]) which is then
used as the function expression for a new individual.

The default value is an implementation of the effective standard algorithm used
to generate GP trees for the initial population: ramped half-and-half. This
implementation, in the form of =cljgp.breeding/generate-ramped=, must be
configured by partial application on a map containing =:max-depth= and/or
=:grow-chance= keys. Respectively, these configure the maximum tree depth, and
the probability of the /grow/ method being used as opposed to the /full/
method. Details on these methods can be found in the docstrings of
=cljgp.breeding/generate-tree= and =generate-ramped= (or various introductory GP
literature such as [fn:gpfg]).

A custom function to replace =generate-ramped= must take an experiment
configuration map as its only argument, and return either a valid tree or =nil=
(if generation failed to produce a valid tree and should be retried). From the
configuration map the various properties required to generate trees can be
retrieved (such as the function set).

* :population-size
# <<:population-size>>
** Purpose
As the name suggests, defines the size of the population (constant over the
course of all generations).
** Requirements
Must be a non-decimal number.
** Default value
*Required key*, no default available.
** Details
Simply defines how many individuals should exist in each generation. The initial
population and all subsequent ones will have this many individuals.

There is no default, because it will heavily depend on the amount of processing
power and memory (and therefore time) one is willing to spend, as especially
with complex evaluation having to be performed this can increase quickly
(linearly) with the size of the population.

* :rand-seeds
# <<:rand-seeds>>
** Purpose
Defines a seq of the seeds that will be used to initialise the random number
generator of each thread.
