doc/config_reference.html

<div id="outline-container-7.3" class="outline-3">
<h3 id="sec-7.3">Default value </h3>
<div id="text-7.3">

<p><b>Required key</b>, no default available.
</p></div>

</div>

<div id="outline-container-7.4" class="outline-3">
<h3 id="sec-7.4">Details </h3>
<div id="text-7.4">

<p>The <code>:function-set</code> key defines a collection of symbols. These symbols will be
used by the GP process at function positions in the generated trees (in tree
terms: non-terminal or non-leaf nodes). To do this, the type of the function
symbol, the number of arguments, and the required type of the arguments has to
be defined. This is achieved through the <code>:gp-type</code> metadata key, which defines
the type of the function, and the <code>:gp-arg-types</code> metadata key, which must
define a positional sequence of argument types. This is best illustrated with an
example.
</p>
<p>
Let's say we want to use Clojure's standard <code>nth</code> function in an experiment. We
could define it as follows in the experiment configuration:
</p>


<pre class="src src-clojure">
(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">my-config</span>
     {<span style="color: #AABBFF;">:function-set</span> [(primitive `nth {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">::element</span>
                                      <span style="color: #AABBFF;">:gp-arg-types</span> [<span style="color: #AABBFF;">::index</span> <span style="color: #AABBFF;">::seq</span>]})
                     ...]})
</pre>




<p>
The <code>primitive</code> function simply takes a symbol and map as argument, and returns
the symbol with the map as metadata (think <code>with-meta</code> with a more fitting name
for this purpose).
</p>
<p>
Note the backquoting of the symbol: using just <code>nth</code> will not work, as that
would be the <i>value</i> of <code>nth</code>, i.e., the function itself. Using a normal quote,
<code>'nth</code>, would work in this case, but keep in mind that the symbol
is resolved to its namespace in an <code>eval</code> call in the <code>cljgp.evaluation</code>
namespace. This will not cause problems for Clojure functions, but any functions
you define will not be available, causing errors. For that reason it is a good
habit to always backtick symbols so that they are namespaced correctly, unless
they will be locals (i.e., they will be passed in as argument).
</p>
<p>
Back to the function arguments. Clojure's <code>nth</code> function takes an index as first
argument, and a sequence as second, and returns the element in the sequence at
the index. Using the given definition, the GP process will only use <code>nth</code> in a
tree at a position where a node of type <code>::element</code> is allowed. Then, as its
first argument only nodes of type <code>::index</code> will be used, and any node that may
be considered as its second argument must be of type <code>::seq</code>.
</p>
<p>
These type relations are tested using <code>isa?</code>, which means you can use Clojure's
powerful ad hoc hierarchy functionality to define your own type hierarchy. Java
class identifiers can also be used.
</p>
<p>
The value of <code>nil</code> can also be used as type, though it is only useful for
performing a GP run without any type restrictions, by using <code>nil</code> for all
types. Because <code>isa?</code> is used for type checking, and the only combination with
<code>nil</code> for which it returns true is <code>(isa? nil nil)</code>, its use is identical to
using a keyword that is not part of a hierarchy. Hence, it is almost always a
better idea to use a keyword (for example, <code>::any</code>) so that it is easier to
define a type hierarchy later on. For an untyped GP experiment, the above
definition could look like this:
</p>


<pre class="src src-clojure">
(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">my-untyped-config</span>
     {<span style="color: #AABBFF;">:function-set</span> [(primitive `nth {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">::any</span>
                                      <span style="color: #AABBFF;">:gp-arg-types</span> [<span style="color: #AABBFF;">::any</span> <span style="color: #AABBFF;">::any</span>]})
                     ...]})
</pre>




<p>
If you have a function that does not take arguments, but does need to be
applied, use an empty vector for <code>:gp-arg-types</code>.
</p>
<p>
Note that although the key is called a <i>set</i>, it is not recommended that you use
a Clojure set to define it. Due to implementation details (involving the use of
<code>nth</code>) these will be relatively slow. Vectors are a much faster choice.
</p>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><a name=":pop-generation-fn" id=":pop-generation-fn"></a>:pop-generation-fn </h2>
<div id="text-8">


</div>

<div id="outline-container-8.1" class="outline-3">
<h3 id="sec-8.1">Purpose </h3>
<div id="text-8.1">

<p>Defines the function used to generate the initial population of individuals (the
size of which is defined in <a href="#sec-9">:population-size</a>.
</p></div>

</div>

<div id="outline-container-8.2" class="outline-3">
<h3 id="sec-8.2">Requirements </h3>
<div id="text-8.2">

<p>Must be a function that takes an experiment configuration as its argument (from
which values such as the function and terminal sets can be retrieved), and
returns a tree or <code>nil</code>.
</p></div>

</div>

<div id="outline-container-8.3" class="outline-3">
<h3 id="sec-8.3">Default value </h3>
<div id="text-8.3">

<p><code>#(cljgp.breeding/generate-ramped {:max-depth 7, :grow-chance 0.5} %1)</code>
</p>
<p>
<i>(Equivalent to</i> <code>(partial generate-ramped {:max-depth 7, :grow-chance 0.5})</code> <i>).</i>
</p></div>

</div>

<div id="outline-container-8.4" class="outline-3">
<h3 id="sec-8.4">Details </h3>
<div id="text-8.4">

<p>In order to perform a GP run, an initial population is required. The function
defined as value of this key is used to generate the expression trees in the
population. Note the important difference between the breeding functions (which
return full individuals) and this function (which return just trees).
</p>
<p>
When a valid tree has been generated by this function, cljgp will insert the
tree into the appropriate <code>fn</code> form (using <a href="#sec-6">:func-template-fn</a>) which is then
used as the function expression for a new individual.
</p>
<p>
The default value is an implementation of the effective standard algorithm used
to generate GP trees for the initial population: ramped half-and-half. This
implementation, in the form of <code>cljgp.breeding/generate-ramped</code>, must be
configured by partial application on a map containing <code>:max-depth</code> and/or
<code>:grow-chance</code> keys. Respectively, these configure the maximum tree depth, and
the probability of the <i>grow</i> method being used as opposed to the <i>full</i>
method. Details on these methods can be found in the docstrings of
<code>cljgp.breeding/generate-tree</code> and <code>generate-ramped</code> (or various introductory GP
literature such as <sup><a class="footref" name="fnr.1.2" href="#fn.1">1</a></sup>).
</p>
<p>
A custom function to replace <code>generate-ramped</code> must take an experiment
configuration map as its only argument, and return either a valid tree or <code>nil</code>
(if generation failed to produce a valid tree and should be retried). From the
configuration map the various properties required to generate trees can be
retrieved (such as the function set).
</p>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><a name=":population-size" id=":population-size"></a>:population-size </h2>
<div id="text-9">


</div>

<div id="outline-container-9.1" class="outline-3">
<h3 id="sec-9.1">Purpose </h3>
<div id="text-9.1">

<p>As the name suggests, defines the size of the population (constant over the
course of all generations).
</p></div>

</div>

<div id="outline-container-9.2" class="outline-3">
<h3 id="sec-9.2">Requirements </h3>
<div id="text-9.2">

<p>Must be a non-decimal number.
</p></div>

</div>

<div id="outline-container-9.3" class="outline-3">
<h3 id="sec-9.3">Default value </h3>
<div id="text-9.3">

<p><b>Required key</b>, no default available.
</p></div>

</div>

<div id="outline-container-9.4" class="outline-3">
<h3 id="sec-9.4">Details </h3>
<div id="text-9.4">

<p>Simply defines how many individuals should exist in each generation. The initial
population and all subsequent ones will have this many individuals.
</p>
<p>
There is no default, because it will heavily depend on the amount of processing
power and memory (and therefore time) one is willing to spend, as especially
with complex evaluation having to be performed this can increase quickly
(linearly) with the size of the population.
</p>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><a name=":rand-seeds" id=":rand-seeds"></a>:rand-seeds </h2>
<div id="text-10">


</div>

<div id="outline-container-10.1" class="outline-3">
<h3 id="sec-10.1">Purpose </h3>
<div id="text-10.1">

<p>Defines a seq of the seeds that will be used to initialise the random number
generator of each thread.
</p></div>

</div>
