doc/src/config_reference.org
** Requirements
Seq must contain at least as many seeds as the number of threads that will be
used (defined in =:threads=).
Seeds should be non-decimal, specifically of type Long.
** Default value
=(cljgp.config/seeds-from-time)=
** Details
The value for this key can be any kind of sequence as long as it contains
sufficient elements for the number of threads to be used.

The default seq returned by calling =cljgp.config/seeds-from-time= is an
infinite lazy sequence of integers based on the system time. By calling it as
=(seeds-from-time true)=, the seeds that are used will be printed to stdout at
the start of the run.

* :rand-fn-maker
# <<:rand-fn-maker>>
** Purpose
Defines a function that produces functions that return random numbers, typically
by encapsulating an RNG instance in a closure.
** Requirements
Function must take one argument, which is the seed to initialise the RNG with,
and must return a function that takes no arguments and returns a random number
of type =double= (or =Double=).
** Default value
=make-default-rand=
** Details
Some implementation background is of interest here: random numbers are generated
by calling the function =cljgp.random/gp-rand=, which acts much like
=clojure.core/rand=. For each thread, =gp-rand= is bound to a separate function,
so that each thread has its own RNG with its own state and seed. This guarantees
deterministic results for identical seeds.

Where the [[:rand-seeds]] value is used for said seeds, the function given as the
value of =:rand-fn-maker= is applied to each seed to produce such a
thread-specific rand function that will be bound to =gp-rand=. These replacement
functions are created once during the configuration preprocessing that occurs
before a run begins in earnest.

Of course, the implementation of this =gp-rand=-replacement producer function
depends on what RNG is used. An example that uses the [[https://uncommons-maths.dev.java.net/][Uncommons Maths]] library's
Mersenne Twister implementation is provided in =cljgp.tools.unc-math-random=. If
you wish to use an RNG that is neither Java's Random nor the above Mersenne
Twister RNG, take a look at the source code of both the Uncommons Maths example
and =cljgp.random=.

* :root-type
# <<:root-type>>
** Purpose
Defines the type that the root node of the tree must satisfy.
** Requirements
Must be either a keyword, a Java class name, or =nil=.
** Default value
=nil=
** Details
When a program/tree is generated or transformed, the result must be valid with
respect to the type constraints defined in the experiment configuration. To do
this, we need to define what type the root of the tree must be, as it has no
parents of whom we can check the argument types.

If the value of =:root-type= is a keyword or Java class name, any node
considered for the root position in the tree must have a type for which =(isa?
<node-type> <root-type>)= returns true.

For example, if =:root-type= is defined as =java.lang.Number=, all nodes with
=:gp-type= defined as =java.lang.Integer= could be used as root, as =(isa?
Integer Number)= is true. Nodes with type =String= however cannot.

When =:root-type= is =nil=, only nodes with type =nil= can be picked as root.

* :selection-fn
# <<:selection-fn>>
** Purpose
Defines the function used (by the provided breeders) to select individuals for
breeding.
** Requirements
Must be a function that takes a population as its only argument, and returns a
single individual from that population.
** Default value
=#(cljgp.selection/tournament-select {:size 7} %1)=

/(Equivalent to/ =(partial tournament-select {:size 7})= /)./
** Details
The included breeder functions all use the function defined in =:selection-fn=
to select the individuals that will reproduce.

The default is an implementation of tournament selection, a method that is
widely used and documented[fn:gpfg]. The tournament size should be defined by partially
applying on a map containing a =:size= key (using =partial=, or an anonymous
function), after which the remaining argument will be a given population. The
default is configured to size 7, as can be seen in the listing of the default
value above.

Note that it is not required for a breeding function to use this value to
perform its selection. As said, all included breeders do use it.

* :terminal-set
# <<:terminal-set>>
** Purpose
Defines the set of symbols to use as terminals/leaves (typically
variables/values).
** Requirements
Must be a sequence of symbols. The symbols must have metadata that defines the
=:gp-type= key. The value for =:gp-type= must be a valid GP type (keyword, Java
class, or nil).
** Default value
*Required key*, no default available.
