doc/config_reference.html

<div id="outline-container-10.2" class="outline-3">
<h3 id="sec-10.2">Requirements </h3>
<div id="text-10.2">

<p>Seq must contain at least as many seeds as the number of threads that will be
used (defined in <code>:threads</code>).
Seeds should be non-decimal, specifically of type Long.
</p></div>

</div>

<div id="outline-container-10.3" class="outline-3">
<h3 id="sec-10.3">Default value </h3>
<div id="text-10.3">

<p><code>(cljgp.config/seeds-from-time)</code>
</p></div>

</div>

<div id="outline-container-10.4" class="outline-3">
<h3 id="sec-10.4">Details </h3>
<div id="text-10.4">

<p>The value for this key can be any kind of sequence as long as it contains
sufficient elements for the number of threads to be used.
</p>
<p>
The default seq returned by calling <code>cljgp.config/seeds-from-time</code> is an
infinite lazy sequence of integers based on the system time. By calling it as
<code>(seeds-from-time true)</code>, the seeds that are used will be printed to stdout at
the start of the run.
</p>
</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">:rand-fn-maker </h2>
<div id="text-11">


</div>

<div id="outline-container-11.1" class="outline-3">
<h3 id="sec-11.1">Purpose </h3>
<div id="text-11.1">

<p>Defines a function that produces functions that return random numbers, typically
by encapsulating an RNG instance in a closure.
</p></div>

</div>

<div id="outline-container-11.2" class="outline-3">
<h3 id="sec-11.2">Requirements </h3>
<div id="text-11.2">

<p>Function must take one argument, which is the seed to initialise the RNG with,
and must return a function that takes no arguments and returns a random number
of type <code>double</code> (or <code>Double</code>).
</p></div>

</div>

<div id="outline-container-11.3" class="outline-3">
<h3 id="sec-11.3">Default value </h3>
<div id="text-11.3">

<p><code>make-default-rand</code>
</p></div>

</div>

<div id="outline-container-11.4" class="outline-3">
<h3 id="sec-11.4">Details </h3>
<div id="text-11.4">

<p>Some implementation background is of interest here: random numbers are generated
by calling the function <code>cljgp.random/gp-rand</code>, which acts much like
<code>clojure.core/rand</code>. For each thread, <code>gp-rand</code> is bound to a separate function,
so that each thread has its own RNG with its own state and seed. This guarantees
deterministic results for identical seeds.
</p>
<p>
Where the <a href="#sec-10">:rand-seeds</a> value is used for said seeds, the function given as the
value of <code>:rand-fn-maker</code> is applied to each seed to produce such a
thread-specific rand function that will be bound to <code>gp-rand</code>. These replacement
functions are created once during the configuration preprocessing that occurs
before a run begins in earnest.
</p>
<p>
Of course, the implementation of this <code>gp-rand</code>-replacement producer function
depends on what RNG is used. An example that uses the <a href="https://uncommons-maths.dev.java.net/">Uncommons Maths</a> library's
Mersenne Twister implementation is provided in <code>cljgp.tools.unc-math-random</code>. If
you wish to use an RNG that is neither Java's Random nor the above Mersenne
Twister RNG, take a look at the source code of both the Uncommons Maths example
and <code>cljgp.random</code>.
</p>
</div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">:root-type </h2>
<div id="text-12">


</div>

<div id="outline-container-12.1" class="outline-3">
<h3 id="sec-12.1">Purpose </h3>
<div id="text-12.1">

<p>Defines the type that the root node of the tree must satisfy.
</p></div>

</div>

<div id="outline-container-12.2" class="outline-3">
<h3 id="sec-12.2">Requirements </h3>
<div id="text-12.2">

<p>Must be either a keyword, a Java class name, or <code>nil</code>.
</p></div>

</div>

<div id="outline-container-12.3" class="outline-3">
<h3 id="sec-12.3">Default value </h3>
<div id="text-12.3">

<p><code>nil</code>
</p></div>

</div>

<div id="outline-container-12.4" class="outline-3">
<h3 id="sec-12.4">Details </h3>
<div id="text-12.4">

<p>When a program/tree is generated or transformed, the result must be valid with
respect to the type constraints defined in the experiment configuration. To do
this, we need to define what type the root of the tree must be, as it has no
parents of whom we can check the argument types.
</p>
<p>
If the value of <code>:root-type</code> is a keyword or Java class name, any node
considered for the root position in the tree must have a type for which <code>(isa? &lt;node-type&gt; &lt;root-type&gt;)</code> returns true.
</p>
<p>
For example, if <code>:root-type</code> is defined as <code>java.lang.Number</code>, all nodes with
<code>:gp-type</code> defined as <code>java.lang.Integer</code> could be used as root, as <code>(isa? Integer Number)</code> is true. Nodes with type <code>String</code> however cannot.
</p>
<p>
When <code>:root-type</code> is <code>nil</code>, only nodes with type <code>nil</code> can be picked as root.
</p>
</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">:selection-fn </h2>
<div id="text-13">


</div>

<div id="outline-container-13.1" class="outline-3">
<h3 id="sec-13.1">Purpose </h3>
<div id="text-13.1">

<p>Defines the function used (by the provided breeders) to select individuals for
breeding.
</p></div>

</div>

<div id="outline-container-13.2" class="outline-3">
<h3 id="sec-13.2">Requirements </h3>
<div id="text-13.2">

<p>Must be a function that takes a population as its only argument, and returns a
single individual from that population.
</p></div>

</div>

<div id="outline-container-13.3" class="outline-3">
<h3 id="sec-13.3">Default value </h3>
<div id="text-13.3">

<p><code>#(cljgp.selection/tournament-select {:size 7} %1)</code>
</p>
<p>
<i>(Equivalent to</i> <code>(partial tournament-select {:size 7})</code> <i>).</i>
</p></div>

</div>

<div id="outline-container-13.4" class="outline-3">
<h3 id="sec-13.4">Details </h3>
<div id="text-13.4">

<p>The included breeder functions all use the function defined in <code>:selection-fn</code>
to select the individuals that will reproduce.
</p>
<p>
The default is an implementation of tournament selection, a method that is
widely used and documented<sup><a class="footref" name="fnr.1.3" href="#fn.1">1</a></sup>. The tournament size should be defined by partially
applying on a map containing a <code>:size</code> key (using <code>partial</code>, or an anonymous
function), after which the remaining argument will be a given population. The
default is configured to size 7, as can be seen in the listing of the default
value above.
</p>
<p>
Note that it is not required for a breeding function to use this value to
perform its selection. As said, all included breeders do use it.
</p>
</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><a name=":terminal-set" id=":terminal-set"></a>:terminal-set </h2>
<div id="text-14">


</div>

<div id="outline-container-14.1" class="outline-3">
<h3 id="sec-14.1">Purpose </h3>
<div id="text-14.1">

<p>Defines the set of symbols to use as terminals/leaves (typically
variables/values).
</p></div>

</div>

<div id="outline-container-14.2" class="outline-3">
<h3 id="sec-14.2">Requirements </h3>
<div id="text-14.2">

<p>Must be a sequence of symbols. The symbols must have metadata that defines the
<code>:gp-type</code> key. The value for <code>:gp-type</code> must be a valid GP type (keyword, Java
class, or nil).
</p></div>

</div>
