doc/src/config_reference.org
** Details
The value for the =:terminal-set= key defines the collection of symbols the GP
process can use as terminal nodes in the program trees. These symbols may
for example resolve to global vars (that might be bound to a value during
evaluation), or local arguments to the evolved function. In order to use these
symbols at valid positions in generated trees, their type must be defined
through the =:gp-type= key.

Similar to function symbols defined in the [[:function-set]], the type of terminal
nodes can be a keyword (perhaps from an ad hoc hierarchy), a Java class
identifier, or =nil= (which functions as a keyword with no hierarchy). Type
relations are checked using =isa?=.

The following example comes from the included regression example
(/reg\_exp.clj/):
#+BEGIN_SRC clojure
(def my-config
     {...
      :terminal-set [(prim 'x {:gp-type Number})

		     (prim 'y {:gp-type Number})]
      ...
      :func-template-fn (make-func-template '[x y])
      ...})
#+END_SRC

Here =prim= is an abbreviation of =cljgp.config/primitive=, which is a function
taking a symbol and a map, and returns the symbol with the map attached as
metadata (like =with-meta=, but with some extra error checks).

The =x= and =y= symbols defined as terminals in the example are not
namespace-resolved, because they will be passed in as arguments as defined in
the [[:func-template-fn]] key.

An alternative would be to use Vars as terminals that will be bound to a value
using =binding= during evaluation:
#+BEGIN_SRC clojure
(def myX nil)
(def myY nil)

(def my-config
     {...
      :terminal-set [(prim `myX {:gp-type Number}) ; note the backtick

		     (prim `myY {:gp-type Number})]
      ...})
#+END_SRC

If this approach is used, the symbols must be namespace-resolved here using the
backtick, or errors will occur when compiling the evolved functions for
evaluation.

Note that although the key is called a /set/, it is not recommended that you use
a Clojure set to define it. Due to implementation details (involving the use of
=nth=) these will be relatively slow. Vectors are a much faster choice.

* :threads
# <<:threads>>
** Purpose
Defines the number of threads that the computation will be divided over.
** Requirements
Must be a non-decimal number.
** Default value
1
** Details
GP is data parallel during breeding, evaluation and the generation of the
initial population. These phases are where the work is divided over the number
of threads defined here. The threads that are used come from a thread pool,
using =future= calls (computation is still forced to occur within the relevant
functions).

* :validate-tree-fn
# <<:validate-tree-fn>>
** Purpose
Defines the predicate function used to check if a tree is valid (if not, a new
tree must be generated or bred).
** Requirements
Must be a predicate (function returning true or false) that takes an expression
tree as its only argument. When false is returned, the tree will not be used and
a new one will be created.
** Default value
=identity= (returns true for all trees)
** Details
A very common issue in GP is that of /bloat/ [fn:gpfg], namely the excessive growth of the
trees in the population, leading to bad performance in both the results of the
evolution and the speed of computation. One way to avoid this is to define a
validation function in this =:validate-tree-fn= key that considers overly large
trees invalid.

Such a function could look something like =#(< (cljgp.util/tree-depth %1) 10)=
in order to prevent trees of ten nodes deep or more from being added to the
population.

Note that by default there is no limit on tree size or depth, as it is highly
domain dependent. It is highly recommended you configure one with a reasonable
depth limit for your experiment.

Of course this predicate can be used for other purposes than limiting size. Note
that when it is applied to a tree, that tree is already validly typed, so checking this 
not needed.


[fn:gpfg] R. Poli, W.B. Langdon, N.F. McPhee, and J.R. Koza. @<em>[[http://www.gp-field-guide.org.uk/][A Field Guide to
Genetic Programming]]@</em>, 2008. 
