doc/config_reference.html

<div id="outline-container-14.3" class="outline-3">
<h3 id="sec-14.3">Default value </h3>
<div id="text-14.3">

<p><b>Required key</b>, no default available.
</p></div>

</div>

<div id="outline-container-14.4" class="outline-3">
<h3 id="sec-14.4">Details </h3>
<div id="text-14.4">

<p>The value for the <code>:terminal-set</code> key defines the collection of symbols the GP
process can use as terminal nodes in the program trees. These symbols may
for example resolve to global vars (that might be bound to a value during
evaluation), or local arguments to the evolved function. In order to use these
symbols at valid positions in generated trees, their type must be defined
through the <code>:gp-type</code> key.
</p>
<p>
Similar to function symbols defined in the <a href="#sec-7">:function-set</a>, the type of terminal
nodes can be a keyword (perhaps from an ad hoc hierarchy), a Java class
identifier, or <code>nil</code> (which functions as a keyword with no hierarchy). Type
relations are checked using <code>isa?</code>.
</p>
<p>
The following example comes from the included regression example
(<i>reg_exp.clj</i>):
</p>


<pre class="src src-clojure">
(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">my-config</span>
     {...
      <span style="color: #AABBFF;">:terminal-set</span> [(prim 'x {<span style="color: #AABBFF;">:gp-type</span> Number})

                     (prim 'y {<span style="color: #AABBFF;">:gp-type</span> Number})]
      ...
      <span style="color: #AABBFF;">:func-template-fn</span> (make-func-template '[x y])
      ...})
</pre>




<p>
Here <code>prim</code> is an abbreviation of <code>cljgp.config/primitive</code>, which is a function
taking a symbol and a map, and returns the symbol with the map attached as
metadata (like <code>with-meta</code>, but with some extra error checks).
</p>
<p>
The <code>x</code> and <code>y</code> symbols defined as terminals in the example are not
namespace-resolved, because they will be passed in as arguments as defined in
the <a href="#sec-6">:func-template-fn</a> key.
</p>
<p>
An alternative would be to use Vars as terminals that will be bound to a value
using <code>binding</code> during evaluation:
</p>


<pre class="src src-clojure">
(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">myX</span> nil)
(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">myY</span> nil)

(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">my-config</span>
     {...
      <span style="color: #AABBFF;">:terminal-set</span> [(prim `myX {<span style="color: #AABBFF;">:gp-type</span> Number}) <span style="color: #119933; background-color: #132313;">; </span><span style="color: #119933; background-color: #132313;">note the backtick
</span>
                     (prim `myY {<span style="color: #AABBFF;">:gp-type</span> Number})]
      ...})
</pre>




<p>
If this approach is used, the symbols must be namespace-resolved here using the
backtick, or errors will occur when compiling the evolved functions for
evaluation.
</p>
<p>
Note that although the key is called a <i>set</i>, it is not recommended that you use
a Clojure set to define it. Due to implementation details (involving the use of
<code>nth</code>) these will be relatively slow. Vectors are a much faster choice.
</p>
</div>
</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">:threads </h2>
<div id="text-15">


</div>

<div id="outline-container-15.1" class="outline-3">
<h3 id="sec-15.1">Purpose </h3>
<div id="text-15.1">

<p>Defines the number of threads that the computation will be divided over.
</p></div>

</div>

<div id="outline-container-15.2" class="outline-3">
<h3 id="sec-15.2">Requirements </h3>
<div id="text-15.2">

<p>Must be a non-decimal number.
</p></div>

</div>

<div id="outline-container-15.3" class="outline-3">
<h3 id="sec-15.3">Default value </h3>
<div id="text-15.3">

<p>1
</p></div>

</div>

<div id="outline-container-15.4" class="outline-3">
<h3 id="sec-15.4">Details </h3>
<div id="text-15.4">

<p>GP is data parallel during breeding, evaluation and the generation of the
initial population. These phases are where the work is divided over the number
of threads defined here. The threads that are used come from a thread pool,
using <code>future</code> calls (computation is still forced to occur within the relevant
functions).
</p>
</div>
</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16">:validate-tree-fn </h2>
<div id="text-16">


</div>

<div id="outline-container-16.1" class="outline-3">
<h3 id="sec-16.1">Purpose </h3>
<div id="text-16.1">

<p>Defines the predicate function used to check if a tree is valid (if not, a new
tree must be generated or bred).
</p></div>

</div>

<div id="outline-container-16.2" class="outline-3">
<h3 id="sec-16.2">Requirements </h3>
<div id="text-16.2">

<p>Must be a predicate (function returning true or false) that takes an expression
tree as its only argument. When false is returned, the tree will not be used and
a new one will be created.
</p></div>

</div>

<div id="outline-container-16.3" class="outline-3">
<h3 id="sec-16.3">Default value </h3>
<div id="text-16.3">

<p><code>identity</code> (returns true for all trees)
</p></div>

</div>

<div id="outline-container-16.4" class="outline-3">
<h3 id="sec-16.4">Details </h3>
<div id="text-16.4">

<p>A very common issue in GP is that of <i>bloat</i> <sup><a class="footref" name="fnr.1.4" href="#fn.1">1</a></sup>, namely the excessive growth of the
trees in the population, leading to bad performance in both the results of the
evolution and the speed of computation. One way to avoid this is to define a
validation function in this <code>:validate-tree-fn</code> key that considers overly large
trees invalid.
</p>
<p>
Such a function could look something like <code>#(&lt; (cljgp.util/tree-depth %1) 10)</code>
in order to prevent trees of ten nodes deep or more from being added to the
population.
</p>
<p>
Note that by default there is no limit on tree size or depth, as it is highly
domain dependent. It is highly recommended you configure one with a reasonable
depth limit for your experiment.
</p>
<p>
Of course this predicate can be used for other purposes than limiting size. Note
that when it is applied to a tree, that tree is already validly typed, so checking this 
not needed.
</p>

</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> R. Poli, W.B. Langdon, N.F. McPhee, and J.R. Koza. <em><a href="http://www.gp-field-guide.org.uk/">A Field Guide to Genetic Programming</a></em>, 2008.
</p>
</div>
</div>
<div id="postamble"><p class="author"> Author: Stefan van der Meer
<a href="mailto:stefanvandermeerREMOVE@THISgmail.com">&lt;stefanvandermeerREMOVE@THISgmail.com&gt;</a>
</p>
<p class="date"> Date: 2009</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
